"Developed by : Mohamad Zalaf"

""صناعة بوت بسيط لبيع البروكسيات
يتم البيع فيه يدوياً من قبل الأدمن

فيه 4 أزرار للمستخدم

[الأول طلب بروكسي ستاتيك Static]
[طلب بروكسي سوكسSocks 5]
[إحالاتي]
[الإعدادات]

الزر الأول ستاتيك:
تظهر أزرار التالية تحمل أسماء و أعلام الدول
US أميركا 
 UK بريطانيا 
 DE ألمانيا 
 fr فرنسا
أدخل يدويا
و عند اختيار أي دولة تظهر المناطق التالية في أزرار وضع inline بعد تغيير قائمة الدول لولايات
مع زر إدخال يدوي


الزر الثاني سوكس 
Us 
uk 
de fr
 ca 
Australia
 Austria 
أدخل يدوياً
كذلك الأمر ولايات لكل منها كالتالي
مع زر أدخل يدويا


بعد اختيار الولاية لكل في كل من الزرين ، يرسل رسالة للمستخدم للتواصل مع الدعم ليتم الدفع و تحوي الرسالة رقم معرف فريد للطلب من 16 خانة


ثم يطلب البوت أن يحدد المستخدم بأي طريقة قام بالدفع عن طريق أزرار وضع inline ، تحوي الطرق المدرجة في الرسائل التالية
ثم يطلب أن يتم إرسال الإثبات ، يتم قبول صورة لقطة شاشة ، أو نص رسالة
و يتم حفظها برسالة اسمها إثبات دفع للطلب بمعرف : xxxxxxxxxxxxxxxx

📦 Static Package

🔹 الأسعار:
- Static ISP Risk0: 3$
- Static Residential Verizon: 4$
- Static Residential AT&T: 6$

━━━━━━━━━━━━━━━
💳 طرق الدفع المحلية:

- شام كاش:
cc849f22d5117db0b8fe5667e6d4b758

- سيرياتيل كاش:
55973911
14227865

━━━━━━━━━━━━━━━
🪙 طرق الدفع بالعملات الرقمية:

- Coinex:
sohilskaf123@gmail.com

- Binance:
1121540155

- Payeer:
P1114452356

━━━━━━━━━━━━━━━
📩 الرجاء إرسال إثبات الدفع للبوت مع تفاصيل الطلب  
⏱️ يرجى الانتظار حتى تتم معالجة العملية من قبل الأدمن

معرف الطلب : xxxxxxxxxxxxxxxx

جميع القيم و الأرقام التي يمكن نسخها أجعلها mono
عدا الإيميلات 

رسالة السوكس 
📦 Socks Package
كافة دول العالم مع ميزة اختيار الولاية والمزود للبكج

🔹 الأسعار:
- باكج 5 بروكسيات مؤقتة: 0.4$
- باكج 10 بروكسيات مؤقتة: 0.7$

━━━━━━━━━━━━━━━
💳 طرق الدفع المحلية:

- شام كاش:
cc849f22d5117db0b8fe5667e6d4b758

- سيرياتيل كاش:
55973911
14227865
━━━━━━━━━━━━━━━
🪙 طرق الدفع بالعملات الرقمية:

- Coinex:
sohilskaf123@gmail.com

- Binance:
1121540155

- Payeer:
P1114452356

━━━━━━━━━━━━━━━
📩 الرجاء إرسال إثبات الدفع للبوت مع تفاصيل الطلب  
⏱️ يرجى الانتظار حتى تتم معالجة العملية من قبل الأدمن

معرف الطلب : xxxxxxxxxxxxxxx


و بنفس الوقت ينظم البوت طلب و يرسله للأدمن

على
 شكل
طلب جديد 

الاسم : الأول + الأخير
اسم المستخدم : @username
معرف المستخدم : xxxxxxxxxx
 _____________
نوع البروكسي :
الدولة :
الولاية :
_____________
تم الدفع عبر :
السعر :
_____________
معرف الطلب : xxxxxxxxxxxxxxxx

و رسالة تليها ، يقوم البوت بالرد على رسالة الطلب الجديد برسالة عنوانها إثبات الدفع للطلب بمعرف xxxxxxxxxxxxxxxxx و معها لقطة الشاشة



و يتطابق معرف الطلب الذي يصل للأدمن مع الذي يظهر للمستخدم 


يظهر تحت رسالة الطلب الجديد الذي يصل للأدمن زر اسمه معالجة الطلب ،
يسأل البوت هل عملية الدفع ناجحة و حقيقية ، مع خياري نعم أو لا ، 
إذا اختار الآدمن لا ، يتم رفض الطلب  ، و سؤال الآدمن إن كان يريد إرسال رسالة مخصصة للمستخدم بخيارين نعم فيتم طلب إدخال الرسالة و خيار إرسال ، و لا يتم إرسال فشل معالجة طلبك للمستخدم 

و يتم حذفه من الرسائل بعد 48 ساعة و إعلام المستخدم بفشل العملية 

و إذا اختار الآدمن نعم عن الدفع

يبدأ البوت بسؤال الأدمن عن تفاصيل البوت بالترتيب
ليتم تجميعها برسالة
يطلب التالي واحد تلو الآخر
1-نوع البروكسي بزرين للنوعين المتوفرين و بوضع inline
2- عنوان البروكسي يدويا 
3- البورت يدويا 
4-الدولة خيارات الدول المتوفر و زر غير ذلك ليدخل يدويا 
5-الولاية أزرار الولايات مع زر غير ذلك لإدخال اليدوي
 6- اسم المستخدم 
7- كلمة المرور
مع رسالة شكر قصيرة

و عند اختيار الآدمن زر معالجة الطلب إعلام المتسخدم بأنه جاري معالجة الطلب حاليا ، و قبل ذلك يكون يعرض سيتم معالجة الطلب يدويا من الآدمن بأقرب وقت 




زر الإحالة
فيه 3 أزرار إنشاء رابط الإحالة
و زر عرض رصيد الإحالة
و زر استرداد القيمة المالية
أنشئ نطام إحالة متكامل


زر الإعدادات
ضمنه زر اللغة لغتين عربي و إنكليزي لكل البوت و الرسائل التي تصل المستخدم


أريد أمر /admin_login
يطلب كلمة مرور و هي sohilSOHIL
ليصل الآدمن لصلاحياته
كيبورده الرئيسي يحوي زر اسمه إدارة الطلبات ضمنه زر الطلبات المعلقة
يعيد إرسال البوت جميع الطلبات التي لم يعالجها الآدمن بعد بنفس المبدأ السابق
زر حذف الطلبات ، ضمنه زرين حذف الطلبات الفاشلة ، و زر حذف الطلبات التي تم معالجتها

في كيبورد الآدمن أيضا زر اسمه إدارة الأموال 
فيه زرين الأول إحصاء المبيعات ، يحسب قيمة مجموع جميع المبيعات الناجحة
و الثاني إدارة الأسعار
فيه زري نوعي البروكسي يتم اختيار النوع المحدد و تغيير سعره بالدولار عن طريق إرساله للبوت برسالة

زر في الكيبورد الرئيس للأدمن اسمه الإحالات
ضمنه زر تحديد قيمة الإحالة الواحدة ، يحدد الآدمن قيمة الإحالة عن طريق إرسال الرقم للبوت 0.1  مثلا و هو الافتراضي ، و بالدولار
و زر إحصائيات المستخدمين يرسل البوت رسالة مرتبة من الأعلى عدد إحالات حتى الأدنى بجانب اسم كل مستخدم و بشكل مرقم و رصيد المستخدم

الزر الثالث تصفير رصيد ، بقائمة منسدلة من الأسفل و مع @ يتم البحث عن مستخدم و اختياره ، بحيث يتم تصفير رصيده من الإحالات ، و يبقى عدد الإحالات دون تصفير فقط قيمة الدولار


زر الإعدادات في الكيبورد الرئيسي
تغيير اللغة
و زر لتحديد ساعات الهدوء ضمنه الأوقات التي يعمل بها صوت إشعارات البوت و ليس يتوقف عن العمل
و زر استعلام عن مستخدم أيضا بقائمة منسدلة يتم البحث بها إما برقم المعرف أو ب اسم المستخدم @ و عند اختيار مستخدم و إرساله للبوت
يعطي تقرير شامل
اسم
اسم المستخدم
المعرف
عدد الشراءات الناجحة
قيمة الشراء الكاملة 
عدد الشراءات الفاشلة
عدد الحالات كاملة 
رصيد الإحالات كاملة
هل يوجد طلب معلق أو لا 
آخر عملية شراء ناجحة



ملاحظة جميع الرسائل يتم توثيقها
بالوقت
التاريخ""


""Mohamad Zalaf ©2025""
